# PeakCoolingLoadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PeakCoolingLoadParam Property
ParameterTypeId Class See Also
---
"Peak Cooling Load"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PeakCoolingLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PeakCoolingLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PeakCoolingLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace